#### LISTS and DATAFRAMES in R

A list is a sequenced collection of different objects of R, like vectors, numbers, characters, other lists as well, and so on. 
List as a container of correlated information, well structured and easy to read.

In [1]:
movie <- list("Toy Story", 1995, c("Animation", "Adventure", "Comedy"))

In [2]:
class(movie)

[1] "list"

In [3]:
typeof(movie[0])

[1] "list"

In [4]:
movie

[[1]]
[1] "Toy Story"

[[2]]
[1] 1995

[[3]]
[1] "Animation" "Adventure" "Comedy"

In [5]:
movie[0]

list()

In [6]:
movie[1]

[[1]]
[1] "Toy Story"

In [7]:
movie[2:3]

[[1]]
[1] 1995

[[2]]
[1] "Animation" "Adventure" "Comedy"

In [8]:
a<-list("a",10,5.8,c("XYZ",60))

In [9]:
a

[[1]]
[1] "a"

[[2]]
[1] 10

[[3]]
[1] 5.8

[[4]]
[1] "XYZ" "60"

In [10]:
a[1]

[[1]]
[1] "a"

In [11]:
a[1]

[[1]]
[1] "a"

In [12]:
a[-1]

[[1]]
[1] 10

[[2]]
[1] 5.8

[[3]]
[1] "XYZ" "60"

In [13]:
a

[[1]]
[1] "a"

[[2]]
[1] 10

[[3]]
[1] 5.8

[[4]]
[1] "XYZ" "60"

In [14]:
a[1:2]

[[1]]
[1] "a"

[[2]]
[1] 10

### Named lists

In [15]:
movie<-list( name = "Toy Story",
             year = 1995,
             genre = c("Animation", "Adventure", "Comedy")
           )

In [16]:
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

In [17]:
movie["genre"]

$genre
[1] "Animation" "Adventure" "Comedy"

In [19]:
movie $genre

[1] "Animation" "Adventure" "Comedy"

In [20]:
class(movie$name)
class(movie$foreign)

[1] "character"

[1] "NULL"

In [21]:
class(movie["name"])
class(movie["foreign"])

[1] "list"

[1] "list"

In [22]:
movie[["age"]] <- 5

In [23]:
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

$age
[1] 5

In [24]:
movie[["age"]] <- 6

In [25]:
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

$age
[1] 6

In [26]:
movie[["age"]] <- NULL
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

#### Concatenating Lists

In [27]:
movie_part1 <- list(name = "Toy Story")
movie_part2 <- list(year = 1995, genre = c("Animation", "Adventure", "Comedy"))

In [28]:
movie_part1

$name
[1] "Toy Story"

In [29]:
movie_part2

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

In [30]:
movie_concatenated <- c(movie_part1, movie_part2)

In [31]:
movie_concatenated

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

### DataFrames

In [32]:
movies <- data.frame(name = c("Toy Story", "Akira", "The Breakfast Club", "The Artist",
                              "Modern Times", "Fight Club", "City of God", "The Untouchables"),
                    year = c(1995, 1998, 1985, 2011, 1936, 1999, 2002, 1987)
                    )

In [33]:
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

In [34]:
movies <- data.frame(name = c("Toy Story", "Akira", "The Breakfast Club", "The Artist",
                              "Modern Times", "Fight Club", "City of God", "The Untouchables"),
                    year = c(1995, 1998, 1985, 2011, 1936, 1999, 2002, 1987),
                    stringsAsFactors=F)

In [35]:
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

In [36]:
head(movies)

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999

In [37]:
tail(movies)

  name               year
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

In [38]:
summary(movies)

     name                year
 Length:8           Min.   :1936
 Class :character   1st Qu.:1986
 Mode  :character   Median :1996
                    Mean   :1989
                    3rd Qu.:2000
                    Max.   :2011

In [39]:
dim(movies)

[1] 8 2

In [40]:
movies$name

[1] "Toy Story"          "Akira"              "The Breakfast Club"
[4] "The Artist"         "Modern Times"       "Fight Club"
[7] "City of God"        "The Untouchables"

In [41]:
movies["name"]

  name
1 Toy Story
2 Akira
3 The Breakfast Club
4 The Artist
5 Modern Times
6 Fight Club
7 City of God
8 The Untouchables

In [42]:
movies[1]

  name
1 Toy Story
2 Akira
3 The Breakfast Club
4 The Artist
5 Modern Times
6 Fight Club
7 City of God
8 The Untouchables

str() is one of most useful functions in R. With this function you can obtain textual information about an object

In [43]:
str(movies)

'data.frame':	8 obs. of  2 variables:
 $ name: chr  "Toy Story" "Akira" "The Breakfast Club" "The Artist" ...
 $ year: num  1995 1998 1985 2011 1936 ...

In [44]:
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

In [45]:
class(movies$year)

[1] "numeric"

In [46]:
movies[1,2]

[1] 1995

In [47]:
head(movies)

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999

In [48]:
tail(movies)

  name               year
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987

### Add new Column into our data frame

In [49]:
movies['length'] <- c(81, 125, 97, 100, 87, 139, 130, 119)
movies

  name               year length
1 Toy Story          1995  81
2 Akira              1998 125
3 The Breakfast Club 1985  97
4 The Artist         2011 100
5 Modern Times       1936  87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119

### Combine Data Frames
In R, we use the rbind() and the cbind() function to combine two data frames together.

#### rbind() - combines two data frames vertically
#### cbind() - combines two data frames horizontally

In [50]:
New_DF <- cbind(movies, movie_type=c("Comedy","Action","Thriller","Romantic","Comedy","Action","Thriller","Action"))

In [51]:
New_DF

  name               year length movie_type
1 Toy Story          1995  81    Comedy
2 Akira              1998 125    Action
3 The Breakfast Club 1985  97    Thriller
4 The Artist         2011 100    Romantic
5 Modern Times       1936  87    Comedy
6 Fight Club         1999 139    Action
7 City of God        2002 130    Thriller
8 The Untouchables   1987 119    Action

### Add new row into our data frame

In [52]:
# add a new movie to our data set

In [53]:
movies <- rbind(movies, c(name="Dr. Strangelove", year=1964, length=94))
movies

  name               year length
1 Toy Story          1995 81
2 Akira              1998 125
3 The Breakfast Club 1985 97
4 The Artist         2011 100
5 Modern Times       1936 87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119
9 Dr. Strangelove    1964 94

In [54]:
movies <- movies[-12,]
movies

  name               year length
1 Toy Story          1995 81
2 Akira              1998 125
3 The Breakfast Club 1985 97
4 The Artist         2011 100
5 Modern Times       1936 87
6 Fight Club         1999 139
7 City of God        2002 130
8 The Untouchables   1987 119
9 Dr. Strangelove    1964 94

### To delete a column

In [55]:
movies[["length"]] <- NULL
movies

  name               year
1 Toy Story          1995
2 Akira              1998
3 The Breakfast Club 1985
4 The Artist         2011
5 Modern Times       1936
6 Fight Club         1999
7 City of God        2002
8 The Untouchables   1987
9 Dr. Strangelove    1964

### Summarize the Data

In [56]:
movie

$name
[1] "Toy Story"

$year
[1] 1995

$genre
[1] "Animation" "Adventure" "Comedy"

In [57]:
summary(movie)

      Length Class  Mode
name  1      -none- character
year  1      -none- numeric
genre 3      -none- character

In [58]:
length(movies)

[1] 2

### Combining Data Frames - Adding Rows rbind()

In [59]:
Data_Frame1 <- data.frame (
  Training = c("Strength", "Stamina", "Other"),
  Pulse = c(100, 150, 120),
  Duration = c(60, 30, 45)
)

In [60]:
Data_Frame1

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

In [61]:
Data_Frame2 <- data.frame (
  Training = c("Stamina", "Stamina", "Strength"),
  Pulse = c(140, 150, 160),
  Duration = c(30, 30, 20)
)

In [62]:
Data_Frame2

  Training Pulse Duration
1 Stamina  140   30
2 Stamina  150   30
3 Strength 160   20

In [63]:
New_Data_Frame <- rbind(Data_Frame1, Data_Frame2)
New_Data_Frame

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45
4 Stamina  140   30
5 Stamina  150   30
6 Strength 160   20

### Combining Data Frames - Adding Columns cbind()

In [64]:
Data_Frame3 <- data.frame (
  Training = c("Strength", "Stamina", "Other"),
  Pulse = c(100, 150, 120),
  Duration = c(60, 30, 45)
)

In [65]:
Data_Frame3

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

In [66]:
Data_Frame4 <- data.frame (
  Steps = c(3000, 6000, 2000),
  Calories = c(300, 400, 300)
)

In [67]:
Data_Frame4

  Steps Calories
1 3000  300
2 6000  400
3 2000  300

In [68]:
New_Data_Frame1 <- cbind(Data_Frame3, Data_Frame4)
New_Data_Frame1

  Training Pulse Duration Steps Calories
1 Strength 100   60       3000  300
2 Stamina  150   30       6000  400
3 Other    120   45       2000  300

In [69]:
summary(New_Data_Frame1)

     Training     Pulse          Duration        Steps         Calories
 Other   :1   Min.   :100.0   Min.   :30.0   Min.   :2000   Min.   :300.0
 Stamina :1   1st Qu.:110.0   1st Qu.:37.5   1st Qu.:2500   1st Qu.:300.0
 Strength:1   Median :120.0   Median :45.0   Median :3000   Median :300.0
              Mean   :123.3   Mean   :45.0   Mean   :3667   Mean   :333.3
              3rd Qu.:135.0   3rd Qu.:52.5   3rd Qu.:4500   3rd Qu.:350.0
              Max.   :150.0   Max.   :60.0   Max.   :6000   Max.   :400.0

In [70]:
New_Data_Frame1[1]

  Training
1 Strength
2 Stamina
3 Other

In [71]:
Data_Frame <- data.frame (
  Training = c("Strength", "Stamina", "Other"),
  Pulse = c(100, 150, 120),
  Duration = c(60, 30, 45)
)

Data_Frame
# Add a new row
New_row_DF <- rbind(Data_Frame, c("Strength", 110, 110))

# Print the old row


# Print the new row
New_row_DF

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45
4 Strength 110   110

In [72]:
Data_Frame <- data.frame (
  Training = c("Strength", "Stamina", "Other"),
  Pulse = c(100, 150, 120),
  Duration = c(60, 30, 45)
)

Data_Frame 

# Add a new column
New_col_DF <- cbind(Data_Frame, Steps = c(1000, 6000, 2000))

# Print the new column
New_col_DF

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

  Training Pulse Duration Steps
1 Strength 100   60       1000
2 Stamina  150   30       6000
3 Other    120   45       2000

### Remove Rows

In [73]:
Data_Frame <- data.frame (
  Training = c("Strength", "Stamina", "Other"),
  Pulse = c(100, 150, 120),
  Duration = c(60, 30, 45)
)
Data_Frame 
# Remove the first row and column

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

In [74]:
Data_Frame_New <- Data_Frame[-c(1)]

In [75]:
Data_Frame_New

  Pulse Duration
1 100   60
2 150   30
3 120   45

In [76]:
Data_Frame

  Training Pulse Duration
1 Strength 100   60
2 Stamina  150   30
3 Other    120   45

In [77]:
data<- select(Data_Frame,-Duration)

ERROR: Error in select(Data_Frame, -Duration): could not find function "select"

In [ ]:
Data_Frame_New1 <- Data_Frame[,-c(1)]

In [ ]:
Data_Frame_New1

## Saving a Data Frame

In [79]:
Data_Frame_New

  Pulse Duration
1 100   60
2 150   30
3 120   45

In [78]:
write.csv(Data_Frame_New,file="Completed.csv")

In [82]:
write.csv(Data_Frame_New,file="Completed1.csv",row.names=FALSE)